# Pandas Read And Write

In [12]:
import pandas as pd
import numpy as np
np.set_printoptions(precision=4) #vale of precision sholud be 4
pd.options.display.max_rows = 10  #show maximum size 10

# File Read Write Operation

In [6]:
df1=pd.read_csv('resources/ex1.csv') #  Read a csv into a DataFrame
print(type(df1))
df1.head(3)

<class 'pandas.core.frame.DataFrame'>

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [22]:
df_filter=df1[["a","b"]].head() #filter data frames columns
print(df_filter)
df_filter.to_csv('resources/out.csv') #writing data frames into another file
df1.dtypes #Data type

   a   b
0  1   2
1  5   6
2  9  10

a           int64
b           int64
c           int64
d           int64
message    object
dtype: object

In [13]:
pd.read_csv('resources/ex1.csv',header=None) #No header data

   0   1   2   3        4
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [15]:
df =pd.read_csv('resources/ex2.csv', names=['header1','header2', 'header3', 'header4', 'header5', 'header6'])#Giving header
df

   header1  header2  header3  header4 header5  header6
0        1        2        3        4   hello      NaN
1        5        6        7        8   world      NaN
2        9       10       11       12     foo      NaN

In [9]:
df2=pd.read_table('resources/test.tsv') #  Read a csv into a DataFrame
df2.head(3)

        test   test test.1 test.2 test.3
ajith  ajith  ajith  ajith  ajith  ajith
lal      lal    lal    lal    lal    lal

In [16]:
result = pd.read_csv('resources/ex5.csv') #Return True or False based on the value present or not
result
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [4]:
url = "http://www.basketball-reference.com/leagues/NBA_2015_totals.html"

BB_data = pd.read_html(url)         # Read data from the specified url

BB_data[0].iloc[:, 0:20].head(5)      # Check 5 rows (20 columns only)

,Rk,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,FG%,3P,3PA,3P%,2P,2PA,2P%,eFG%,FT,FTA
0,1,Quincy Acy,PF,24,NYK,68,22,1287,152,331,.459,18,60,.300,134,271,.494,.486,76,97
1,2,Jordan Adams,SG,20,MEM,30,0,248,35,86,.407,10,25,.400,25,61,.410,.465,14,23
2,3,Steven Adams,C,21,OKC,70,67,1771,217,399,.544,0,2,.000,217,397,.547,.544,103,205
3,4,Jeff Adrien,PF,28,MIN,17,0,215,19,44,.432,0,0,NaN,19,44,.432,.432,22,38
4,5,Arron Afflalo,SG,29,TOT,78,72,2502,375,884,.424,118,333,.354,257,551,.466,.491,167,198

In [16]:
import csv
with open('resources/ex7.csv') as f: 
    lines = list(csv.reader(f))

header, values = lines[0], lines[1:]
data_dict={h:v for h,v in zip(header,zip(*values))} #creating dictionary from data frames
data_dict

# JSON

In [23]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [25]:
import json
result = json.loads(obj)
asjson = json.dumps(result)
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age','pets'])
siblings

    name  age                    pets
0  Scott   30            [Zeus, Zuko]
1  Katie   38  [Sixes, Stache, Cisco]

# HDF5

In [30]:
frame = pd.DataFrame({'a': np.random.randn(100)})
store = pd.HDFStore('resources/mydata.h5')
store['obj1'] = frame
store['obj1_col'] = frame['a']
store

<class 'pandas.io.pytables.HDFStore'>
File path: resources/mydata.h5

In [31]:
store['obj1']

           a
0   0.606115
1   0.548137
2  -1.319719
3   0.012239
4   0.672748
..       ...
95  1.809124
96 -1.423145
97  0.048579
98  1.427225
99 -0.442128

[100 rows x 1 columns]

In [32]:
store.put('obj2', frame, format='table')
store.select('obj2', where=['index >= 10 and index <= 15'])
store.close()

In [33]:
frame.to_hdf('mydata.h5', 'obj3', format='table')
pd.read_hdf('mydata.h5', 'obj3', where=['index < 5'])

          a
0  0.606115
1  0.548137
2 -1.319719
3  0.012239
4  0.672748

# Web APIs

In [34]:
import requests
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'
resp = requests.get(url)
resp

In [35]:
data = resp.json()
data[2]['user']

{'login': 'Vlek',
 'id': 15008772,
 'node_id': 'MDQ6VXNlcjE1MDA4Nzcy',
 'avatar_url': 'https://avatars2.githubusercontent.com/u/15008772?v=4',
 'gravatar_id': '',
 'url': 'https://api.github.com/users/Vlek',
 'html_url': 'https://github.com/Vlek',
 'followers_url': 'https://api.github.com/users/Vlek/followers',
 'following_url': 'https://api.github.com/users/Vlek/following{/other_user}',
 'gists_url': 'https://api.github.com/users/Vlek/gists{/gist_id}',
 'starred_url': 'https://api.github.com/users/Vlek/starred{/owner}{/repo}',
 'subscriptions_url': 'https://api.github.com/users/Vlek/subscriptions',
 'organizations_url': 'https://api.github.com/users/Vlek/orgs',
 'repos_url': 'https://api.github.com/users/Vlek/repos',
 'events_url': 'https://api.github.com/users/Vlek/events{/privacy}',
 'received_events_url': 'https://api.github.com/users/Vlek/received_events',
 'type': 'User',
 'site_admin': False}

In [36]:
issues = pd.DataFrame(data, columns=['number', 'title',
                                     'labels', 'state'])
issues

,number,title,labels,state
0,32881,DOC: Fix errors in pandas.DataFrame.melt,[],open
1,32880,DOC: Fix errors in pandas.DataFrame.sort_index,[],open
2,32879,TST: Avoid bare pytest.raises in test_series.py,[],open
3,32878,BUG?: should ComplexBlock._can_hold_element/sh...,[],open
4,32877,REF: collect to_xarray tests,"[{'id': 127685, 'node_id': 'MDU6TGFiZWwxMjc2OD...",open
...,...,...,...,...
25,32846,REF: pass align_keys to BlockManager.apply,[],open
26,32845,TST: Improve searchsorted test coverage,[],open
27,32844,Switch dataframe constructor to use dispatch,"[{'id': 211029535, 'node_id': 'MDU6TGFiZWwyMTE...",open
28,32843,DOC: Fix capitalization among headings in docu...,"[{'id': 211029535, 'node_id': 'MDU6TGFiZWwyMTE...",open
29,32842,Fix count segfault,"[{'id': 233160, 'node_id': 'MDU6TGFiZWwyMzMxNj...",open

# Data bases

In [50]:
import sqlite3
#connecting with the database.
db = sqlite3.connect("my_database4.db")
# Drop table if it already exist using execute() method.
db.execute("drop table if exists test_2")
query = """
CREATE TABLE test_2
(a VARCHAR(20), b VARCHAR(20),
 c REAL,        d INTEGER
);"""
con = sqlite3.connect('mydata2.sqlite')
con.execute(query)
con.commit()

In [51]:
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]
stmt = "INSERT INTO test_2 VALUES(?, ?, ?, ?)"
con.executemany(stmt, data)
con.commit()

In [52]:
cursor = con.execute('select * from test_2')
rows = cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [53]:
cursor.description
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5